# Series

In [1]:
import numpy as np
import pandas as pd

In [2]:
 print(pd.Series())

Series([], dtype: object)

In [3]:
Employee_names = ['Simantini','Sayalee','Sakshi','Karuna','Saman','Aarya','Poorva','Neha','Dhanashree','Aditi']
Employee_names

['Simantini',
 'Sayalee',
 'Sakshi',
 'Karuna',
 'Saman',
 'Aarya',
 'Poorva',
 'Neha',
 'Dhanashree',
 'Aditi']

In [4]:
S=pd.Series(Employee_names)
S

0     Simantini
1       Sayalee
2        Sakshi
3        Karuna
4         Saman
5         Aarya
6        Poorva
7          Neha
8    Dhanashree
9         Aditi
dtype: object

In [5]:
S.describe()

count            10
unique           10
top       Simantini
freq              1
dtype: object

In [6]:
S[0]

'Simantini'

In [7]:
S[0:3]

0    Simantini
1      Sayalee
2       Sakshi
dtype: object

In [8]:
S[0:]

0     Simantini
1       Sayalee
2        Sakshi
3        Karuna
4         Saman
5         Aarya
6        Poorva
7          Neha
8    Dhanashree
9         Aditi
dtype: object

In [9]:
S[::-1]

9         Aditi
8    Dhanashree
7          Neha
6        Poorva
5         Aarya
4         Saman
3        Karuna
2        Sakshi
1       Sayalee
0     Simantini
dtype: object

In [10]:
Sorted_series = S.sort_values()

In [11]:
Sorted_series

5         Aarya
9         Aditi
8    Dhanashree
3        Karuna
7          Neha
6        Poorva
2        Sakshi
4         Saman
1       Sayalee
0     Simantini
dtype: object

In [12]:
Sorted_series2 = S.sort_values(ascending=False)
Sorted_series2

0     Simantini
1       Sayalee
4         Saman
2        Sakshi
6        Poorva
7          Neha
3        Karuna
8    Dhanashree
9         Aditi
5         Aarya
dtype: object

# DataFrame

In [13]:
print(pd.DataFrame())

Empty DataFrame
Columns: []
Index: []

In [14]:
data = {
    "Stud_Rno":[1,2,3,4,5,6,7,8,9,10],
    "Stud_name":['Simantini','Sayalee','Sakshi','Karuna','Saman','Aarya','Poorva','Neha','Dhanashree','Aditi'],
    "City":['Satara','Radhanagari','Kolhapur','Satara','Jaysingpur','Kolhapur','Sangali','Shirala','Karvir','Kolhapur'],
    "Marks":[92,95,94,93,98,90,91,88,90,89]    
}

In [15]:
df=pd.DataFrame(data)

In [16]:
df

   Stud_Rno   Stud_name         City  Marks
0         1   Simantini       Satara     92
1         2     Sayalee  Radhanagari     95
2         3      Sakshi     Kolhapur     94
3         4      Karuna       Satara     93
4         5       Saman   Jaysingpur     98
5         6       Aarya     Kolhapur     90
6         7      Poorva      Sangali     91
7         8        Neha      Shirala     88
8         9  Dhanashree       Karvir     90
9        10       Aditi     Kolhapur     89

In [17]:
df.transpose()

,0,1,2,3,4,5,6,7,8,9
Stud_Rno,1,2,3,4,5,6,7,8,9,10
Stud_name,Simantini,Sayalee,Sakshi,Karuna,Saman,Aarya,Poorva,Neha,Dhanashree,Aditi
City,Satara,Radhanagari,Kolhapur,Satara,Jaysingpur,Kolhapur,Sangali,Shirala,Karvir,Kolhapur
Marks,92,95,94,93,98,90,91,88,90,89

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Stud_Rno   10 non-null     int64
 1   Stud_name  10 non-null     object
 2   City       10 non-null     object
 3   Marks      10 non-null     int64
dtypes: int64(2), object(2)
memory usage: 448.0+ bytes

In [19]:
df.describe()

       Stud_Rno     Marks
count  10.00000  10.00000
mean    5.50000  92.00000
std     3.02765   3.05505
min     1.00000  88.00000
25%     3.25000  90.00000
50%     5.50000  91.50000
75%     7.75000  93.75000
max    10.00000  98.00000

In [20]:
df.describe().transpose()

          count  mean      std   min    25%   50%    75%   max
Stud_Rno   10.0   5.5  3.02765   1.0   3.25   5.5   7.75  10.0
Marks      10.0  92.0  3.05505  88.0  90.00  91.5  93.75  98.0

In [21]:
df.dtypes

Stud_Rno      int64
Stud_name    object
City         object
Marks         int64
dtype: object

In [22]:
df.columns

Index(['Stud_Rno', 'Stud_name', 'City', 'Marks'], dtype='object')

In [23]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [24]:
C=df.Marks
C

0    92
1    95
2    94
3    93
4    98
5    90
6    91
7    88
8    90
9    89
Name: Marks, dtype: int64

In [25]:
C.info()

<class 'pandas.core.series.Series'>
RangeIndex: 10 entries, 0 to 9
Series name: Marks
Non-Null Count  Dtype
--------------  -----
10 non-null     int64
dtypes: int64(1)
memory usage: 208.0 bytes

In [26]:
C.describe()

count    10.00000
mean     92.00000
std       3.05505
min      88.00000
25%      90.00000
50%      91.50000
75%      93.75000
max      98.00000
Name: Marks, dtype: float64

In [27]:
df.Marks.mean()

92.0

In [28]:
df.Stud_Rno.mean()

5.5

In [29]:
df.Marks.std()

3.0550504633038935

In [30]:
df.Stud_Rno.std()

3.0276503540974917

In [31]:
df.loc[:,:]

   Stud_Rno   Stud_name         City  Marks
0         1   Simantini       Satara     92
1         2     Sayalee  Radhanagari     95
2         3      Sakshi     Kolhapur     94
3         4      Karuna       Satara     93
4         5       Saman   Jaysingpur     98
5         6       Aarya     Kolhapur     90
6         7      Poorva      Sangali     91
7         8        Neha      Shirala     88
8         9  Dhanashree       Karvir     90
9        10       Aditi     Kolhapur     89

In [32]:
df.loc[:,::-1]

   Marks         City   Stud_name  Stud_Rno
0     92       Satara   Simantini         1
1     95  Radhanagari     Sayalee         2
2     94     Kolhapur      Sakshi         3
3     93       Satara      Karuna         4
4     98   Jaysingpur       Saman         5
5     90     Kolhapur       Aarya         6
6     91      Sangali      Poorva         7
7     88      Shirala        Neha         8
8     90       Karvir  Dhanashree         9
9     89     Kolhapur       Aditi        10

In [33]:
df.head()

   Stud_Rno  Stud_name         City  Marks
0         1  Simantini       Satara     92
1         2    Sayalee  Radhanagari     95
2         3     Sakshi     Kolhapur     94
3         4     Karuna       Satara     93
4         5      Saman   Jaysingpur     98

In [34]:
df.tail()

   Stud_Rno   Stud_name      City  Marks
5         6       Aarya  Kolhapur     90
6         7      Poorva   Sangali     91
7         8        Neha   Shirala     88
8         9  Dhanashree    Karvir     90
9        10       Aditi  Kolhapur     89

In [43]:
selected_columns = df[['City']]
df2 = pd.DataFrame(selected_columns)
df2

          City
0       Satara
1  Radhanagari
2     Kolhapur
3       Satara
4   Jaysingpur
5     Kolhapur
6      Sangali
7      Shirala
8       Karvir
9     Kolhapur